Repository: cuducos/csvsimpletools
Catalog: csvsimpletools/translations/*/LC_MESSAGES/messages.po
Languages: pt

source: Sentence Case
pt: Primeira letra maiúscula

source: Title Case
pt: Palavras iniciando com maiúscula

source: Upper Case
pt: Maiúsculas

source: Lower Case
pt: Minúsculas

source: Concatenate
pt: Concatenar

source: Remove Special Chars
pt: Remover caracteres especiais

source: Alphanumeric Only
pt: Caracteres alfanuméricos

source: Sequential numbers
pt: Números sequenciais

source: Dual sequential numbers
pt: Números sequenciais duplos

source: Add a column to the end of the CSV with the value of the first column in sentence case.
pt: Adiciona uma coluna à direita do CSV utilizando o conteúdo da primeira coluna e convertendo a primeira letra para maiúscula.

source: Add a column to the end of the CSV with the value of the first column in title case.
pt: Adiciona uma coluna à direita do CSV utilizando o conteúdo da primeira coluna e convertendo a primeira letra de cada palavra para maiúscula.

source: Add a column to the end of the CSV with the value of the first column in upper case.
pt: Adiciona uma coluna à direita do CSV utilizando o conteúdo da primeira coluna com todas as letras maiúsculas.

source: Add a column to the end of the CSV with the value of the first column in lower case.
pt: Adiciona uma coluna à direita do CSV utilizando o conteúdo da primeira coluna com todas as letras minúsculas.

source: Add a column to the end of the CSV with the value of the first and second columns concatenated.
pt: Adiciona uma coluna à direita do CSV concatenando o conteúdo da primeira e da segunda coluna.

source: Add a column to the end of the CSV with the value of the first column replacing any special character.
pt: Adiciona uma coluna à direita do CSV utilizando o conteúdo da primeira coluna removendo caracteres especiais.

source: Add a column to the end of the CSV with the value of the first column keeping only letters and numbers .
pt: Adiciona uma coluna à direita do CSV utilizando o conteúdo da primeira mantendo apenas letras e números.

source: Add a column to the end of the CSV with a sequential number (starting with 1, with increment in each row).
pt: Adiciona uma coluna à direita do CSV com uma sequêcia numérica (começando com 1, e aumentando a cada linha).

source: Add two columns to the end of the CSV with a sequential number for each different first and second column.
pt: Adiciona duas colunas à direita do CSV com identificadores (números) únicos para os conteúdos da primeira e segunda coluna.

source: Please, use .csv files only.
pt: Por favor, utilize apenas arquivos .csv.

source: CSV Simple Tools
pt: CSV Simples

source: by
pt: por

source: This project uses no database at all, no input data is stored
pt: Esse projeto não utiliza banco de dados e nenhuma informação fica armazenada no servidor

source: It's open source, check
pt: Código aberto, confira o

source: this project at GitHub
pt: repositório no GitHub

source: Choose your CSV file
pt: Escolha seu CSV

source: Choose what to do
pt: Escolha que fazer

source: Example
pt: Exemplo

source: Input
pt: Entrada

source: Output
pt: Resultado

source: Get your new CSV
pt: Baixe seu novo CSV
